wiki/20171107-python-standard-library.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-03-19 Mon 18:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>python标准库</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="shuchaoma" />
<link rel="stylesheet" type="text/css" href="https://www.shuchaoma.com/css/stylesheet.css">
<link rel="shortcut icon" href="/css/favicon.ico">
</head>
<body>
<div id="content">
<h1 class="title">python标准库</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7115929">1. struct</a>
<ul>
<li><a href="#org0d5fa14">1.1. 功能</a></li>
<li><a href="#org53724e4">1.2. 使用场景</a></li>
<li><a href="#org87f42aa">1.3. 注意事项</a></li>
</ul>
</li>
<li><a href="#orgf791eb6">2. uuid</a>
<ul>
<li><a href="#org2c2ca3f">2.1. 功能：</a></li>
<li><a href="#org60fe24e">2.2. 使用场景</a></li>
<li><a href="#org5a0101d">2.3. 注意事项</a></li>
</ul>
</li>
<li><a href="#org1dff413">3. collection模块</a>
<ul>
<li><a href="#orga0bca85">3.1. 简介</a></li>
<li><a href="#org66c5c39">3.2. namedtuple</a></li>
<li><a href="#orge2395d3">3.3. Counter</a></li>
<li><a href="#org9905fe4">3.4. deque</a></li>
<li><a href="#orgcb5b904">3.5. OrderedDict</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
任何一门计算机语言出现，除了自身的语义语法之外，往往都自带不少标准库；方便用户控制计算机（C语言除外，系统调用接口本身就是用c实现的）。
python在这方面相比其他语言优势更加明显。其内置标准库涵盖文件操作、文本处理、高级数据结构、压缩、网络协议、函数式编程、调试等各各个方面。<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>
</p>

<p>
下面给个人维护平时所用标准库的Introduction，重在使用场景和注意点。
</p>

<div id="outline-container-org7115929" class="outline-2">
<h2 id="org7115929"><span class="section-number-2">1</span> struct</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org0d5fa14" class="outline-3">
<h3 id="org0d5fa14"><span class="section-number-3">1.1</span> 功能</h3>
<div class="outline-text-3" id="text-1-1">
<p>
 struct模块唯一的作用是帮助python对象与C语言struct（结构体）相互转换。
struct模块主要实现了三个函数：
</p>
<ul class="org-ul">
<li>struct.pack() : 将python对象pack成二进制流</li>
<li>struct.unpack()：将二进制流unpack成python对象</li>
<li>struct.calcsize()： 计算fmt的所在内存空间的字节数。</li>
</ul>
</div>
</div>
<div id="outline-container-org53724e4" class="outline-3">
<h3 id="org53724e4"><span class="section-number-3">1.2</span> 使用场景</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>网络交互</li>
</ol>
<p>
类似于HTTP使用纯文本交互的协议并不在多数，大量协议或者软件设计时使用的是“二进制”格式；这个场景特别适用于struct模块。
当发送数据时，需要将待发送的协议or数据字段按照fmt pack为二进制流。
当接受数据时，需要将接收到的协议or数据字段按照fmt unpack为python对象。
</p>
<ol class="org-ol">
<li>二进制文件读写</li>
</ol>
<p>
很多图像格式、地球物理地震资料数据通过二进制存储；对二进制文件读写也是struct的用武之地。
</p>
</div>
</div>
<div id="outline-container-org87f42aa" class="outline-3">
<h3 id="org87f42aa"><span class="section-number-3">1.3</span> 注意事项</h3>
<div class="outline-text-3" id="text-1-3">
<ol class="org-ol">
<li>struct模块除了实现了对应的pack、unpack函数外，还单独定义了Struct类。在对单个fmt进行大批量、多次数据转换时，运行效率会更高一些。</li>
<li>struct模块使用时，fmt格式定义需要指定byte-order-alignment：这个技术点可能引发的内存空间溢出、写入与实际读出数据不同等问题。（@、=、&lt;、&gt;、? 标识不同byte-order-alignment选项）</li>
<li>struct模块使用时，fmt格式对每个元素占用内存空间的长度需要明确。(同时对端如果使用C语言撰写，也要保证甚至最好在不同的平台上，可以生成我们预想的长度的二进制流)</li>
<li>很多时候，namedtuple跟struct一起使用。</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgf791eb6" class="outline-2">
<h2 id="orgf791eb6"><span class="section-number-2">2</span> uuid</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org2c2ca3f" class="outline-3">
<h3 id="org2c2ca3f"><span class="section-number-3">2.1</span> 功能：</h3>
<div class="outline-text-3" id="text-2-1">
<p>
uuid (universally unique identifiers 全局唯一标志符)。这个模块根据RFC 4122定义了几个不同的uuid的函数。
</p>
</div>
</div>
<div id="outline-container-org60fe24e" class="outline-3">
<h3 id="org60fe24e"><span class="section-number-3">2.2</span> 使用场景</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li>关系数据库中为每一个record设定一个标志时。</li>
</ol>
</div>
</div>
<div id="outline-container-org5a0101d" class="outline-3">
<h3 id="org5a0101d"><span class="section-number-3">2.3</span> 注意事项</h3>
<div class="outline-text-3" id="text-2-3">
<ol class="org-ol">
<li>uuid.uuid1(): 基于时间戳、mac、随机数生成；可以保证全球范围内唯一。当然也存在安全信息泄露的可能性。</li>
<li>uuid.uuid3()：基于名字的md5散列值生成；相同命名空间内同一个name生成的uuid一致。</li>
<li>uuid.uuid4()：基于随机数，有一定重复概率。最好不用。</li>
<li>uuid.uuid5()：同uuid3，不同的是使用SHA-1算法。</li>
</ol>
<p>
一般情况下，uuid1就是你说要的。
</p>
</div>
</div>
</div>
<div id="outline-container-org1dff413" class="outline-2">
<h2 id="org1dff413"><span class="section-number-2">3</span> collection模块</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orga0bca85" class="outline-3">
<h3 id="orga0bca85"><span class="section-number-3">3.1</span> 简介</h3>
<div class="outline-text-3" id="text-3-1">
<p>
collection模块实现了一些比较特别的容器类型，用来替代通用的内置类型tuple、list、dict、set等。在某些场景下，这些specialized类型更加切合。
下面介绍几个常用的类型。
</p>
</div>
</div>

<div id="outline-container-org66c5c39" class="outline-3">
<h3 id="org66c5c39"><span class="section-number-3">3.2</span> namedtuple</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Returns a new tuple subclass named typename. (namedtuple会返回tuple的之类），这个之类与tuple的区别在于：python内置的tuple只能通过positon来索引元素，而namedtuple可以通过key索引元素。
一切可以使用tuple的地方都可以使用namedtuple代替。用法举例：
</p>
<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #b9ca4a;">import</span> collections
&gt;&gt;&gt; <span style="color: #e7c547;">Point</span> = collections.namedtuple<span style="color: #eaeaea;">(</span><span style="color: #70c0b1;">"Point"</span>, <span style="color: #70c0b1;">"x, y, z"</span><span style="color: #eaeaea;">)</span>
&gt;&gt;&gt; <span style="color: #e7c547;">p1</span> = Point<span style="color: #eaeaea;">(</span>1, 2, 3<span style="color: #eaeaea;">)</span>
&gt;&gt;&gt; <span style="color: #b9ca4a;">print</span><span style="color: #eaeaea;">(</span>p1<span style="color: #eaeaea;">)</span>
Point<span style="color: #eaeaea;">(</span>x=1, y=2, z=3<span style="color: #eaeaea;">)</span>
&gt;&gt;&gt; <span style="color: #e7c547;">p2</span> = Point<span style="color: #eaeaea;">(</span>z=4, y=5, z=6<span style="color: #eaeaea;">)</span>
&gt;&gt;&gt; <span style="color: #e7c547;">p2</span> = Point<span style="color: #eaeaea;">(</span>z=4, y=5, x=6<span style="color: #eaeaea;">)</span>
&gt;&gt;&gt; <span style="color: #b9ca4a;">print</span><span style="color: #eaeaea;">(</span>p2<span style="color: #eaeaea;">)</span>
Point<span style="color: #eaeaea;">(</span>x=6, y=5, z=4<span style="color: #eaeaea;">)</span>
&gt;&gt;&gt; p1+p2
<span style="color: #eaeaea;">(</span>1, 2, 3, 6, 5, 4<span style="color: #eaeaea;">)</span>
&gt;&gt;&gt; <span style="color: #e7c547;">p3</span> = Point._make<span style="color: #eaeaea;">(</span><span style="color: #70c0b1;">[</span>7, 8, 9<span style="color: #70c0b1;">]</span><span style="color: #eaeaea;">)</span>
&gt;&gt;&gt; <span style="color: #b9ca4a;">print</span><span style="color: #eaeaea;">(</span>p3<span style="color: #eaeaea;">)</span>
Point<span style="color: #eaeaea;">(</span>x=7, y=8, z=9<span style="color: #eaeaea;">)</span>
</pre>
</div>
<p>
注：
</p>
<ol class="org-ol">
<li>namedtuple返回的是一个class 类型，而p1 = Point(1, 2, 3)这是生成一个class实例，也就是对象。</li>
<li>Point.<sub>make</sub>(iterable)函数接受一个iterable，将起转换为Point对象。</li>
</ol>
</div>
</div>

<div id="outline-container-orge2395d3" class="outline-3">
<h3 id="orge2395d3"><span class="section-number-3">3.3</span> Counter</h3>
<div class="outline-text-3" id="text-3-3">
<p>
dict subclass for counting hashable objects.
It is an unordered collection where elements are stored as dictionary keys and their counts are stored as dictionary values.
在其他计算机语言，Counter有时也被称之为multiset。
</p>
<div class="org-src-container">
<pre class="src src-python">&#21407;&#22411;&#65306;collections.Counter<span style="color: #eaeaea;">(</span><span style="color: #70c0b1;">[</span>iterable-<span style="color: #b9ca4a;">or</span>-mapping<span style="color: #70c0b1;">]</span><span style="color: #eaeaea;">)</span>
- Elements are counted <span style="color: #b9ca4a;">from</span> an iterable <span style="color: #b9ca4a;">or</span> initialized <span style="color: #b9ca4a;">from</span> another mapping <span style="color: #eaeaea;">(</span><span style="color: #b9ca4a;">or</span> counter<span style="color: #eaeaea;">)</span>
- &#23545;iterable&#36827;&#34892;&#32479;&#35745;&#35745;&#25968;&#65292;&#36820;&#22238;&#19968;&#20010;Counter&#23545;&#35937;&#12290;&#25110;&#32773;&#36890;&#36807;&#19968;&#20010;mapping&#21021;&#22987;&#21270;&#19968;&#20010;Counter&#23545;&#35937;&#12290;
&gt;&gt;&gt; <span style="color: #e7c547;">c</span> = Counter<span style="color: #eaeaea;">()</span>                           <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">a new, empty counter</span>
&gt;&gt;&gt; <span style="color: #e7c547;">c</span> = Counter<span style="color: #eaeaea;">(</span><span style="color: #70c0b1;">'gallahad'</span><span style="color: #eaeaea;">)</span>                 <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">a new counter from an iterable</span>
&gt;&gt;&gt; <span style="color: #e7c547;">c</span> = Counter<span style="color: #eaeaea;">(</span>cats=4, dogs=2, people=3<span style="color: #eaeaea;">)</span>   <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">a new counter from a mapping</span>
&gt;&gt;&gt; c.most_common<span style="color: #eaeaea;">(</span>2<span style="color: #eaeaea;">)</span>
<span style="color: #eaeaea;">[</span><span style="color: #70c0b1;">(</span><span style="color: #70c0b1;">'cats'</span>, 4<span style="color: #70c0b1;">)</span>, <span style="color: #70c0b1;">(</span><span style="color: #70c0b1;">'people'</span>, 3<span style="color: #70c0b1;">)</span><span style="color: #eaeaea;">]</span>
&gt;&gt;&gt; <span style="color: #c397d8;">list</span><span style="color: #eaeaea;">(</span>c.elements<span style="color: #70c0b1;">()</span><span style="color: #eaeaea;">)</span>
<span style="color: #eaeaea;">[</span><span style="color: #70c0b1;">'cats'</span>, <span style="color: #70c0b1;">'cats'</span>, <span style="color: #70c0b1;">'cats'</span>, <span style="color: #70c0b1;">'cats'</span>, <span style="color: #70c0b1;">'dogs'</span>, <span style="color: #70c0b1;">'dogs'</span>, <span style="color: #70c0b1;">'people'</span>, <span style="color: #70c0b1;">'people'</span>, <span style="color: #70c0b1;">'people'</span><span style="color: #eaeaea;">]</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org9905fe4" class="outline-3">
<h3 id="org9905fe4"><span class="section-number-3">3.4</span> deque</h3>
<div class="outline-text-3" id="text-3-4">
<p>
list-like container with fast appends and pops on either end.
deque是一个栈/队列的通用实现,是double-ended queue的简称。它支持线程安全的、更加有效的、在两端进行pop、append操作，而且仅有O(1)的复杂度。
尽管list也可以支持双端操作，但是在left侧进行pop和插入时，需要O(n)复杂度。
deque比较常用的method有：
append(x)、appendleft(x)、pop、popleft、clear、count(x)等
</p>
</div>
</div>

<div id="outline-container-orgcb5b904" class="outline-3">
<h3 id="orgcb5b904"><span class="section-number-3">3.5</span> OrderedDict</h3>
<div class="outline-text-3" id="text-3-5">
<p>
dict subclass that remembers the order entries were added
OrderdDict用起来跟dict基本一样,唯一的区别是它会记住元素被插入的顺序，支持按序输出元素。
</p>
<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">regular unsorted dictionary</span>
&gt;&gt;&gt; <span style="color: #e7c547;">d</span> = <span style="color: #eaeaea;">{</span><span style="color: #70c0b1;">'banana'</span>: 3, <span style="color: #70c0b1;">'apple'</span>: 4, <span style="color: #70c0b1;">'pear'</span>: 1, <span style="color: #70c0b1;">'orange'</span>: 2<span style="color: #eaeaea;">}</span>

&gt;&gt;&gt; <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">dictionary sorted by key</span>
&gt;&gt;&gt; OrderedDict<span style="color: #eaeaea;">(</span><span style="color: #c397d8;">sorted</span><span style="color: #70c0b1;">(</span>d.items<span style="color: #e7c547;">()</span>, key=<span style="color: #b9ca4a;">lambda</span> t: t<span style="color: #e7c547;">[</span>0<span style="color: #e7c547;">]</span><span style="color: #70c0b1;">)</span><span style="color: #eaeaea;">)</span>
OrderedDict<span style="color: #eaeaea;">(</span><span style="color: #70c0b1;">[</span><span style="color: #e7c547;">(</span><span style="color: #70c0b1;">'apple'</span>, 4<span style="color: #e7c547;">)</span>, <span style="color: #e7c547;">(</span><span style="color: #70c0b1;">'banana'</span>, 3<span style="color: #e7c547;">)</span>, <span style="color: #e7c547;">(</span><span style="color: #70c0b1;">'orange'</span>, 2<span style="color: #e7c547;">)</span>, <span style="color: #e7c547;">(</span><span style="color: #70c0b1;">'pear'</span>, 1<span style="color: #e7c547;">)</span><span style="color: #70c0b1;">]</span><span style="color: #eaeaea;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="https://docs.python.org/3/library/index.html">The Python Standard Library</a>
</p></div></div>


</div>
</div></div>
</body>
</html>
